#include<stdio.h>
//1.在屏幕上输出以下图案：
//*
//***
//*****
//*******
//*********
//***********
//*************
//***********
//*********
//*******
//*****
//***
//*
int main() {
	int i, j, k;
	for ( i=1; i <= 7; i++) {
		for ( j=1; j <= 7-i; j++) {
			printf(" ");
		}
		for ( k=1; k <= 2*i-1; k++) {
			printf("*");
		}
		printf("\n");

	}
	for (i = 1; i <= 6; i++) {
		for (j = 1; j <= i; j++) {
			printf(" ");
		}
		for (k = 1; k <= ( 7-i)*2-1; k++) {
			printf("*");
		}
		printf("\n");

	}



	return 0;
}